// Шаблонная функция easyfind 
/* T является контейнером int, и найдите первое вхождение 
	второго параметра в первом параметре */
// easyfind(T, int)
/* T - контейнер int ,
Ф-ия, кот. находит 1 вхождение 2-го параметра (первый элемент в T) */

/* STL (стандартная библиотека шаблонов) :
содержит набор шаблонов контейнерных классов : iterator, container, algorithm */
// Контейнер - набор, в кот. хранится несколько объектов одного типа
// Итератор - объект, кот. обес-ет доступ к каждому элементу путем перебора элементов, хранящихся в контейнере ST

// vector <аргумент шаблона> имя объекта(аргумент конструктора - тип);